      * hello world program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello_world.
       PROCEDURE DIVISION.
           DISPLAY 'Hello world!'.
           EXIT PROGRAM. 
